tests/Cases/boundaryTestCases/cyclicAMICurved/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             icoFoam;

startFrom               startTime;

startTime               0;

stopAt                  endTime;

endTime                 0.5;

deltaT                  0.002;

writeControl            timeStep;

writeInterval           50;

writeFormat             binary;

writePrecision          10;

writeCompression        uncompressed;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   0.25;

maxDeltaT               5e-7;

libs
(
    "libWENOEXT.so"
);


// ************************************************************************* //3
